:PROPERTIES:
:ID: ad073cbd-91a1-47d7-b0fb-26492327ded1
:END:
#+title: Revoke Role
#+description: Revoke Role
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:accounts:
#+created: 2026-05-21
#+updated: 2026-05-21

Revoke a role from an account.

#+name: revoke-role
#+begin_src ores-shell :exports none
accounts revoke-role 019c2d92-8448-7158-90d0-ccb8b5f7e812 24a02cd6-1a74-4bdf-9169-408227402106
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<revoke-role>>
EOF
#+END_SRC

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
  Tenant: System (00000000-0000-0000-0000-000000000000)
ORE Studio Shell REPL v0.0.11
Type 'help' for available commands, 'exit' to quit.

ores-shell> V Role revoked successfully!
  Account ID: 019c2d92-8448-7158-90d0-ccb8b5f7e812
  Role ID:    24a02cd6-1a74-4bdf-9169-408227402106
ores-shell> Bye!
#+end_example
